; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob24) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate5)
	(at pallet2 depot2)
	(clear crate14)
	(at pallet3 distributor0)
	(clear crate13)
	(at pallet4 distributor1)
	(clear crate15)
	(at pallet5 distributor2)
	(clear crate7)
	(at pallet6 distributor0)
	(clear crate11)
	(at pallet7 distributor2)
	(clear crate4)
	(at pallet8 depot0)
	(clear crate1)
	(at pallet9 depot0)
	(clear crate6)
	(at pallet10 depot1)
	(clear crate2)
	(at pallet11 distributor0)
	(clear pallet11)
	(at pallet12 distributor1)
	(clear crate12)
	(at truck0 depot1)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 depot2)
	(available hoist9)
	(at hoist10 depot0)
	(available hoist10)
	(at hoist11 depot1)
	(available hoist11)
	(at hoist12 depot0)
	(available hoist12)
	(at hoist13 distributor0)
	(available hoist13)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 depot0)
	(on crate1 pallet8)
	(at crate2 depot1)
	(on crate2 pallet10)
	(at crate3 distributor0)
	(on crate3 crate0)
	(at crate4 distributor2)
	(on crate4 pallet7)
	(at crate5 depot1)
	(on crate5 pallet1)
	(at crate6 depot0)
	(on crate6 pallet9)
	(at crate7 distributor2)
	(on crate7 pallet5)
	(at crate8 distributor0)
	(on crate8 pallet6)
	(at crate9 distributor1)
	(on crate9 pallet4)
	(at crate10 distributor0)
	(on crate10 crate8)
	(at crate11 distributor0)
	(on crate11 crate10)
	(at crate12 distributor1)
	(on crate12 pallet12)
	(at crate13 distributor0)
	(on crate13 crate3)
	(at crate14 depot2)
	(on crate14 pallet2)
	(at crate15 distributor1)
	(on crate15 crate9)
)

(:goal (and
		(on crate0 pallet5)
		(on crate1 pallet9)
		(on crate3 pallet2)
		(on crate4 pallet1)
		(on crate5 pallet7)
		(on crate6 pallet6)
		(on crate7 pallet11)
		(on crate9 crate7)
		(on crate10 pallet12)
		(on crate11 pallet3)
		(on crate12 pallet8)
		(on crate14 crate10)
		(on crate15 crate14)
	)
))

; plan
1. (lift hoist8 crate13 crate3 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist8) (on crate13 crate3)
   added: (lifting hoist8 crate13) (clear crate3)
   goals met: 0 of 13
2. (lift hoist6 crate1 pallet8 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist6) (on crate1 pallet8)
   added: (lifting hoist6 crate1) (clear pallet8)
   goals met: 0 of 13
3. (lift hoist11 crate5 pallet1 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist11) (on crate5 pallet1)
   added: (lifting hoist11 crate5) (clear pallet1)
   goals met: 0 of 13
4. (load hoist11 crate5 truck0 depot1)
   deleted: (lifting hoist11 crate5)
   added: (in crate5 truck0) (available hoist11)
   goals met: 0 of 13
5. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 0 of 13
6. (lift hoist7 crate11 crate10 distributor0)
   deleted: (at crate11 distributor0) (clear crate11) (available hoist7) (on crate11 crate10)
   added: (lifting hoist7 crate11) (clear crate10)
   goals met: 0 of 13
7. (lift hoist13 crate3 crate0 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist13) (on crate3 crate0)
   added: (lifting hoist13 crate3) (clear crate0)
   goals met: 0 of 13
8. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 13
9. (load hoist13 crate3 truck1 distributor0)
   deleted: (lifting hoist13 crate3)
   added: (in crate3 truck1) (available hoist13)
   goals met: 0 of 13
10. (lift hoist3 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet3)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 0 of 13
11. (load hoist3 crate0 truck1 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck1) (available hoist3)
   goals met: 0 of 13
12. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 0 of 13
13. (unload hoist9 crate3 truck1 depot2)
   deleted: (in crate3 truck1) (available hoist9)
   added: (lifting hoist9 crate3)
   goals met: 0 of 13
14. (drop hoist7 crate11 pallet3 distributor0)
   deleted: (lifting hoist7 crate11) (clear pallet3)
   added: (available hoist7) (at crate11 distributor0) (clear crate11) (on crate11 pallet3)
   goals met: 1 of 13
15. (lift hoist2 crate14 pallet2 depot2)
   deleted: (at crate14 depot2) (clear crate14) (available hoist2) (on crate14 pallet2)
   added: (lifting hoist2 crate14) (clear pallet2)
   goals met: 1 of 13
16. (load hoist2 crate14 truck1 depot2)
   deleted: (lifting hoist2 crate14)
   added: (in crate14 truck1) (available hoist2)
   goals met: 1 of 13
17. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 1 of 13
18. (unload hoist7 crate14 truck1 distributor0)
   deleted: (in crate14 truck1) (available hoist7)
   added: (lifting hoist7 crate14)
   goals met: 1 of 13
19. (drop hoist9 crate3 pallet2 depot2)
   deleted: (lifting hoist9 crate3) (clear pallet2)
   added: (available hoist9) (at crate3 depot2) (clear crate3) (on crate3 pallet2)
   goals met: 2 of 13
20. (lift hoist10 crate6 pallet9 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist10) (on crate6 pallet9)
   added: (lifting hoist10 crate6) (clear pallet9)
   goals met: 2 of 13
21. (drop hoist6 crate1 pallet9 depot0)
   deleted: (lifting hoist6 crate1) (clear pallet9)
   added: (available hoist6) (at crate1 depot0) (clear crate1) (on crate1 pallet9)
   goals met: 3 of 13
22. (drop hoist7 crate14 crate10 distributor0)
   deleted: (lifting hoist7 crate14) (clear crate10)
   added: (available hoist7) (at crate14 distributor0) (clear crate14) (on crate14 crate10)
   goals met: 4 of 13
23. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 4 of 13
24. (load hoist10 crate6 truck1 depot0)
   deleted: (lifting hoist10 crate6)
   added: (in crate6 truck1) (available hoist10)
   goals met: 4 of 13
25. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 4 of 13
26. (lift hoist3 crate14 crate10 distributor0)
   deleted: (at crate14 distributor0) (clear crate14) (available hoist3) (on crate14 crate10)
   added: (lifting hoist3 crate14) (clear crate10)
   goals met: 3 of 13
27. (lift hoist7 crate10 crate8 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist7) (on crate10 crate8)
   added: (lifting hoist7 crate10) (clear crate8)
   goals met: 3 of 13
28. (drop hoist7 crate10 crate11 distributor0)
   deleted: (lifting hoist7 crate10) (clear crate11)
   added: (available hoist7) (at crate10 distributor0) (clear crate10) (on crate10 crate11)
   goals met: 3 of 13
29. (unload hoist7 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist7)
   added: (lifting hoist7 crate6)
   goals met: 3 of 13
30. (drop hoist3 crate14 crate10 distributor0)
   deleted: (lifting hoist3 crate14) (clear crate10)
   added: (available hoist3) (at crate14 distributor0) (clear crate14) (on crate14 crate10)
   goals met: 4 of 13
31. (lift hoist3 crate8 pallet6 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 pallet6)
   added: (lifting hoist3 crate8) (clear pallet6)
   goals met: 4 of 13
32. (drop hoist7 crate6 pallet6 distributor0)
   deleted: (lifting hoist7 crate6) (clear pallet6)
   added: (available hoist7) (at crate6 distributor0) (clear crate6) (on crate6 pallet6)
   goals met: 5 of 13
33. (lift hoist4 crate12 pallet12 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist4) (on crate12 pallet12)
   added: (lifting hoist4 crate12) (clear pallet12)
   goals met: 5 of 13
34. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 5 of 13
35. (load hoist4 crate12 truck1 distributor1)
   deleted: (lifting hoist4 crate12)
   added: (in crate12 truck1) (available hoist4)
   goals met: 5 of 13
36. (lift hoist4 crate15 crate9 distributor1)
   deleted: (at crate15 distributor1) (clear crate15) (available hoist4) (on crate15 crate9)
   added: (lifting hoist4 crate15) (clear crate9)
   goals met: 5 of 13
37. (load hoist4 crate15 truck1 distributor1)
   deleted: (lifting hoist4 crate15)
   added: (in crate15 truck1) (available hoist4)
   goals met: 5 of 13
38. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 5 of 13
39. (unload hoist7 crate15 truck1 distributor0)
   deleted: (in crate15 truck1) (available hoist7)
   added: (lifting hoist7 crate15)
   goals met: 5 of 13
40. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 5 of 13
41. (unload hoist6 crate12 truck1 depot0)
   deleted: (in crate12 truck1) (available hoist6)
   added: (lifting hoist6 crate12)
   goals met: 5 of 13
42. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 5 of 13
43. (drop hoist6 crate12 pallet8 depot0)
   deleted: (lifting hoist6 crate12) (clear pallet8)
   added: (available hoist6) (at crate12 depot0) (clear crate12) (on crate12 pallet8)
   goals met: 6 of 13
44. (lift hoist4 crate9 pallet4 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 pallet4)
   added: (lifting hoist4 crate9) (clear pallet4)
   goals met: 6 of 13
45. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 6 of 13
46. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   goals met: 6 of 13
47. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 6 of 13
48. (lift hoist5 crate4 pallet7 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 pallet7)
   added: (lifting hoist5 crate4) (clear pallet7)
   goals met: 6 of 13
49. (load hoist5 crate4 truck0 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   goals met: 6 of 13
50. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 6 of 13
51. (unload hoist11 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist11)
   added: (lifting hoist11 crate4)
   goals met: 6 of 13
52. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 6 of 13
53. (drop hoist11 crate4 pallet1 depot1)
   deleted: (lifting hoist11 crate4) (clear pallet1)
   added: (available hoist11) (at crate4 depot1) (clear crate4) (on crate4 pallet1)
   goals met: 7 of 13
54. (unload hoist5 crate5 truck0 distributor2)
   deleted: (in crate5 truck0) (available hoist5)
   added: (lifting hoist5 crate5)
   goals met: 7 of 13
55. (drop hoist5 crate5 pallet7 distributor2)
   deleted: (lifting hoist5 crate5) (clear pallet7)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 pallet7)
   goals met: 8 of 13
56. (lift hoist5 crate7 pallet5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 pallet5)
   added: (lifting hoist5 crate7) (clear pallet5)
   goals met: 8 of 13
57. (load hoist5 crate7 truck0 distributor2)
   deleted: (lifting hoist5 crate7)
   added: (in crate7 truck0) (available hoist5)
   goals met: 8 of 13
58. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 8 of 13
59. (unload hoist5 crate0 truck1 distributor2)
   deleted: (in crate0 truck1) (available hoist5)
   added: (lifting hoist5 crate0)
   goals met: 8 of 13
60. (drop hoist5 crate0 pallet5 distributor2)
   deleted: (lifting hoist5 crate0) (clear pallet5)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 pallet5)
   goals met: 9 of 13
61. (unload hoist13 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist13)
   added: (lifting hoist13 crate7)
   goals met: 9 of 13
62. (drop hoist8 crate13 pallet11 distributor0)
   deleted: (lifting hoist8 crate13) (clear pallet11)
   added: (available hoist8) (at crate13 distributor0) (clear crate13) (on crate13 pallet11)
   goals met: 9 of 13
63. (drop hoist7 crate15 crate14 distributor0)
   deleted: (lifting hoist7 crate15) (clear crate14)
   added: (available hoist7) (at crate15 distributor0) (clear crate15) (on crate15 crate14)
   goals met: 10 of 13
64. (lift hoist7 crate13 pallet11 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist7) (on crate13 pallet11)
   added: (lifting hoist7 crate13) (clear pallet11)
   goals met: 10 of 13
65. (drop hoist13 crate7 pallet11 distributor0)
   deleted: (lifting hoist13 crate7) (clear pallet11)
   added: (available hoist13) (at crate7 distributor0) (clear crate7) (on crate7 pallet11)
   goals met: 11 of 13
66. (unload hoist8 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist8)
   added: (lifting hoist8 crate9)
   goals met: 11 of 13
67. (drop hoist8 crate9 crate7 distributor0)
   deleted: (lifting hoist8 crate9) (clear crate7)
   added: (available hoist8) (at crate9 distributor0) (clear crate9) (on crate9 crate7)
   goals met: 12 of 13
68. (lift hoist13 crate15 crate14 distributor0)
   deleted: (at crate15 distributor0) (clear crate15) (available hoist13) (on crate15 crate14)
   added: (lifting hoist13 crate15) (clear crate14)
   goals met: 11 of 13
69. (lift hoist8 crate14 crate10 distributor0)
   deleted: (at crate14 distributor0) (clear crate14) (available hoist8) (on crate14 crate10)
   added: (lifting hoist8 crate14) (clear crate10)
   goals met: 10 of 13
70. (drop hoist8 crate14 crate9 distributor0)
   deleted: (lifting hoist8 crate14) (clear crate9)
   added: (available hoist8) (at crate14 distributor0) (clear crate14) (on crate14 crate9)
   goals met: 10 of 13
71. (drop hoist13 crate15 crate14 distributor0)
   deleted: (lifting hoist13 crate15) (clear crate14)
   added: (available hoist13) (at crate15 distributor0) (clear crate15) (on crate15 crate14)
   goals met: 11 of 13
72. (lift hoist8 crate10 crate11 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist8) (on crate10 crate11)
   added: (lifting hoist8 crate10) (clear crate11)
   goals met: 11 of 13
73. (load hoist8 crate10 truck0 distributor0)
   deleted: (lifting hoist8 crate10)
   added: (in crate10 truck0) (available hoist8)
   goals met: 11 of 13
74. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 11 of 13
75. (unload hoist4 crate10 truck0 distributor1)
   deleted: (in crate10 truck0) (available hoist4)
   added: (lifting hoist4 crate10)
   goals met: 11 of 13
76. (drop hoist4 crate10 pallet12 distributor1)
   deleted: (lifting hoist4 crate10) (clear pallet12)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 pallet12)
   goals met: 12 of 13
77. (lift hoist13 crate15 crate14 distributor0)
   deleted: (at crate15 distributor0) (clear crate15) (available hoist13) (on crate15 crate14)
   added: (lifting hoist13 crate15) (clear crate14)
   goals met: 11 of 13
78. (lift hoist8 crate14 crate9 distributor0)
   deleted: (at crate14 distributor0) (clear crate14) (available hoist8) (on crate14 crate9)
   added: (lifting hoist8 crate14) (clear crate9)
   goals met: 11 of 13
79. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 11 of 13
80. (load hoist8 crate14 truck0 distributor0)
   deleted: (lifting hoist8 crate14)
   added: (in crate14 truck0) (available hoist8)
   goals met: 11 of 13
81. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 11 of 13
82. (unload hoist4 crate14 truck0 distributor1)
   deleted: (in crate14 truck0) (available hoist4)
   added: (lifting hoist4 crate14)
   goals met: 11 of 13
83. (drop hoist4 crate14 crate10 distributor1)
   deleted: (lifting hoist4 crate14) (clear crate10)
   added: (available hoist4) (at crate14 distributor1) (clear crate14) (on crate14 crate10)
   goals met: 12 of 13
84. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 12 of 13
85. (load hoist13 crate15 truck0 distributor0)
   deleted: (lifting hoist13 crate15)
   added: (in crate15 truck0) (available hoist13)
   goals met: 12 of 13
86. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 12 of 13
87. (unload hoist4 crate15 truck0 distributor1)
   deleted: (in crate15 truck0) (available hoist4)
   added: (lifting hoist4 crate15)
   goals met: 12 of 13
88. (drop hoist4 crate15 crate14 distributor1)
   deleted: (lifting hoist4 crate15) (clear crate14)
   added: (available hoist4) (at crate15 distributor1) (clear crate15) (on crate15 crate14)
   goals met: 13 of 13
